{
  "suicide_attacks": {
    "description": "The Chicago Project on Security and Terrorism (CPOST) maintains a searchable database on all suicide attacks from 1982 through September 2015. The database includes information about the location of attacks, the target type, the weapon used, and systematic information on the demographic and general biographical characteristics of suicide attackers. The database expands the breadth of the data available in English using native language sources (e.g., Arabic, Hebrew, Russian, Tamil) that are likely to have the most extensive relevant information.\nThe current CPOST-SAD release contains the universe of suicide attacks from 1982 through September 2015, a total of 4,814 attacks in over 40 countries. The CPOST Suicide Attack Database (CPOST-SAD) contains data on the universe of suicide attacks. For each attack, the database includes information about the geographic location, target classification, and weapon(s) used, as well as systematic information on the demographic and general biographical characteristics of suicide attackers. More information about the coding and methodology is available on the CPOST website below.\nNote that multiple attackers or targets are collapsed into a single record for simplicity's sake.\n", 
    "dicts": {
      "count": 8, 
      "levels": {
        "1": {
          "lengths": 6, 
          "key lengths": 6
        }, 
        "2": {
          "lengths": 3, 
          "key lengths": 7
        }, 
        "3": {
          "lengths": 3, 
          "key lengths": 8
        }
      }, 
      "inconsistent": {}, 
      "average branching factor": 3
    }, 
    "tags": [
      "global", 
      "attack", 
      "damage", 
      "kill", 
      "hurt", 
      "destroy", 
      "pain", 
      "suffering", 
      "terror", 
      "terrorism", 
      "religion", 
      "warfare", 
      "war", 
      "car", 
      "bomb", 
      "gun", 
      "shooting"
    ], 
    "atomics": {
      "count": 23, 
      "nones": 0, 
      "ints": 7, 
      "booleans": 1, 
      "longs": 0, 
      "unknown": 0, 
      "strings": 15, 
      "floats": 0
    }, 
    "lists": {
      "count": 3, 
      "lengths": 4616, 
      "complex": 1
    }, 
    "heights": 4, 
    "unions": {
      "count": 0, 
      "keys": {}, 
      "sizes": 0
    }, 
    "length": 4616, 
    "indexes": [
      2
    ], 
    "locals": 0, 
    "size": 3021293
  }
}