{
  "business_dynamics": {
    "description": "<p>The Business Dynamics Statistics (BDS) includes measures of establishment openings and closings, firm startups, job creation and destruction by firm size, age, and industrial sector, and several other statistics on business dynamics. The U.S. economy is comprised of over 6 million establishments with paid employees. The population of these businesses is constantly churning -- some businesses grow, others decline and yet others close. New businesses are constantly replenishing this pool. The BDS series provide annual statistics on gross job gains and losses for the entire economy and by industrial sector, state, and MSA. These data track changes in employment at the establishment level, and thus provide a picture of the dynamics underlying aggregate net employment growth.</p>\n<p>There is a longstanding interest in the contribution of small businesses to job and productivity growth in the U.S. Some recent research suggests that it is business age rather than size that is the critical factor. The BDS permits exploring the respective contributions of both firm age and size.</p>\n<p>BDS is based on data going back through 1976. This allows business dynamics to be tracked, measured and analyzed for young firms in their first critical years as well as for more mature firms including those that are in the process of reinventing themselves in an ever changing economic environment.</p>\n", 
    "dicts": {
      "count": 7, 
      "levels": {
        "1": {
          "lengths": 3, 
          "key lengths": 6
        }, 
        "2": {
          "lengths": 7, 
          "key lengths": 4
        }, 
        "3": {
          "lengths": 4, 
          "key lengths": 12
        }
      }, 
      "inconsistent": {}, 
      "average branching factor": 4
    }, 
    "tags": [
      "government", 
      "united states", 
      "us", 
      "usa", 
      "business", 
      "businesses", 
      "firms", 
      "establishments", 
      "jobs", 
      "census"
    ], 
    "atomics": {
      "count": 25, 
      "nones": 0, 
      "ints": 16, 
      "booleans": 0, 
      "longs": 0, 
      "unknown": 0, 
      "strings": 1, 
      "floats": 8
    }, 
    "lists": {
      "count": 1, 
      "lengths": 1887, 
      "complex": 1
    }, 
    "heights": 4, 
    "unions": {
      "count": 0, 
      "keys": {}, 
      "sizes": 0
    }, 
    "length": 1887, 
    "indexes": [
      2
    ], 
    "locals": 0, 
    "size": 1190413
  }
}